import asyncio

from src.mdt import MDT, get_persistent_memory

chief_expert_memory = get_persistent_memory("chief_expert")

examination_data = {
    "physical_examination": {
        "basic_info": "体温：36.3℃，脉搏：73次/分，呼吸：20次/分，血压：112/67mmHg，身高：166cm，体重：53kg，体表面积：1.5381m^2",
        "ratings": {
            "Barthel": 100,
            "KPS": 100,
            "NRS2002": 1
        },
        "general_condition": "发育正常，营养：中等，自主体位，体型正力型。步入入室，神志清醒，表情自如，查体合作。皮肤：全身皮肤黏膜无皮疹、无黄染、无出血点。无肝掌，未见蜘蛛痣。淋巴结：详见专科查体双侧。头部：头颅大小正常，无异常面容，眼睑无浮肿，结膜无苍白，眼球未见明显异常，巩膜无黄染，双侧瞳孔等大，左瞳孔对光反射灵敏，右瞳孔对光反射灵敏。鼻无畸形，无鼻翼煽动。鼻旁窦压痛无。耳廓无畸形，外耳道无异常分泌物，乳突压痛无，听力粗测正常。唇红润，口腔黏膜正常，舌正常，齿龈正常，齿列齐，扁桃体及口咽情况详见专科查体。声音正常。颈部：颈软，无抵抗感，颈动脉搏动正常，颈静脉正常，气管居中，甲状腺无肿大，未及血管杂音。胸部：胸廓正常，无胸骨叩痛，双侧呼吸运度对称。肋间隙未见明显异常，未及毛细血管搏动征、水冲脉和枪击音。双侧触觉语颤正常，未触及胸膜摩擦感，未触及皮下捻发感，双肺叩诊呈清音，听诊呼吸规整，双肺呼吸音清，未闻及干湿啰音，语音传导未及明显异常，未及明显胸膜摩擦音。心前区无隆起，心尖搏动位于第Ⅴ肋间左锁骨中线内侧0.5cm，未触及抬举样搏动及震颤。无心包摩擦感，心率见上述，心律齐整，明显额外心音。未闻及心包摩擦音。腹部：腹部视诊：外形平坦，胃型无，肠型无，蠕动波无，腹式呼吸存在，脐正常，未见腹壁静脉曲张。触诊：腹部柔软，无液波震颤，无振水音，腹部包块未触及，腹部无压痛反跳痛，胆囊未触及，肝脾情况详见专科查体。双肾区无压痛、叩击痛，血管未见明显异常，肛门未及异常。叩诊：肝浊音界存在，肝上界位于右锁骨中线Ⅴ肋间，移动性浊音无，无明显肾区叩击痛。听诊：肠鸣音正常，无气过水声，血管杂音未闻及。肛门生殖器：外生殖器、肛门、直肠未查。脊柱四肢：脊柱正常，棘突无压痛及叩击痛，活动度自由活动，四肢无畸形，四肢关节活动及动脉搏动未见明显异常。无杵状指趾，Hoffmann征阴性，Babinski征阴性。",
        "special_examination": "双侧锁骨上未及肿大淋巴结。视诊：呼吸运动正常，呼吸节律正常，肋间隙未见明显异常。触诊：双侧语颤正常，胸膜摩擦感未触及。叩诊：双肺叩诊清音，听诊：呼吸音音清，未闻及干湿啰音，双侧语音传导正常、对称，胸膜摩擦感未触及。"
    },
    "auxiliary_examination": [
        {
            "check_type": "电子支气管镜检查",
            "item": "活检：左肺上叶 * 4",
            "result": "患者行全身麻醉。气管通畅光滑，隆突嵴未见增宽。左肺上叶开口可见白色坏死物附着，予以清除后可见左肺上叶舌支及固有支开口可见新生物完全堵塞（距左肺上叶开口0.5cm），NBI模式下见表面异常的微血管改变；予以新生物活检，质脆，易出血，活检后予以凝血酶止血，退镜时未见明显活动性出血。余肺各主、叶、段支气管开口通畅，粘膜光滑，未见新生物、狭窄及出血。",
            "diagnosis": "诊断：\n1. 左肺上叶新生物\n2. 电子支气管镜下活检止血术\n3. 内镜色素检查术"
        },
        {
            "check_type": "医学影像（CT）检查",
            "item": "下腹部CT平扫加增强（薄层），上腹部CT平扫加增强（含薄层），胸部CT平扫加增强（含层）",
            "result": "胸廓对称，气管居中，双肺肺纹理稍增多。左肺门及左肺上叶、邻近纵隔内软组织密度肿块影，与左肺门及邻近纵隔淋巴结、远端肺实变不张分界不清，大小不易精确测量，增强呈不均匀强化；病灶包埋或紧贴部分支气管及动静脉，致部分支气管狭窄或闭塞，部分动静脉狭窄或显示不清；病灶远侧肺内见斑片、片结影、实变不张影。左肺下叶后基底段见一实性渮小结节影，径约0.3cm，强化不易评价。余纵隔内及右肺门、右锁骨上区数个小及稍大淋巴结，大者短径约0.8cm。心脏形态大小未见异常，心包及左侧胸腔少量积液。右侧胸腔未见积液。左侧胸膜稍增厚。\n肝脏形态、大小未见异常，肝内数个低密度无强化小结节，大者径约0.5cm；肝右叶另见点状高密度影。胆囊不大，壁未见明显增厚，囊腔内未见异常密度影；肝内外胆管未见明显扩张。脾脏形态、大小未见异常，实质密度均匀，增强后未见明显异常强化灶。胰形态、大小未见异常，实质密度均匀，胰周脂肪间隙清晰。双肾各见一低密度无强化小结节大者径约0.3cm。腹膜后未见明显肿大淋巴结影。腹腔未见游离液性密度影。胃呈收缩相，胃壁可疑稍厚。",
            "diagnosis": "胸上下腹部CT平扫及增强（含薄层）：\n1. 左肺门及左肺上叶、邻近纵隔内软组织肿块影，考虑肿瘤性病变可能，结合临床及其他检查；伴左肺上叶阻塞性炎变、实变不张，其内部分片结影性质待定，密切随诊。\n2. 左肺门及纵隔内多发增大淋巴结，余纵隔内及右肺门、右锁骨上区数个小及稍大淋巴结。\n3. 左肺下叶后基底段微小结节，随诊。\n4. 心包微少量积液：左侧胸腔少量积液，左侧胸膜稍增厚。\n5. 肝内小囊肿可能；肝内钙化灶；双肾小囊肿；随诊。\n6. 胃呈收缩相，胃壁可疑稍厚，结合临床随诊。"
        },
        {
            "check_type": "医学影像（MR）检查",
            "item": "颅脑平扫加增强",
            "result": "脑实质内未见明显异常信号及强化影；脑沟、脑裂未见明显加深；脑室系统未见明显扩大；中线结构居中。扫及蝶鞍区扩大，其内见TIWI低、T2WI高信号，与脑脊液一致，可见T2WI黑靶征，垂体柄直达鞍底。",
            "diagnosis": "1. 颅内未见确切占位。\n2. 扫及空泡蝶鞍可能，随诊。"
        },
        {
            "check_type": "医学影像（SPECT）检查",
            "item": "新全身骨显像",
            "result": "静脉注射99mTc-MDP 30mCi 2小时后行全身骨骼前、后位显像。\n全身骨骼显示清晰，完整，放射性分布均匀，左右对称，颅骨、胸、脊柱、骨盆、四肢未见放射性异常浓聚、稀疏、缺损区。",
            "diagnosis": "全身骨显像未见明显骨质代谢异常征像。"
        },
        {
            "check_type": "病理检查",
            "item": "左肺上叶",
            "result": "1、<左肺上叶>：灰白小组织3粒，直径0.1cm，（1）全。<左肺上叶>活检小组织，非小细胞癌，待免疫组化检测协助诊断。",
            "diagnosis": ""
        },
        {
            "check_type": "病理检查",
            "item": "左肺上叶",
            "result": "<左肺上叶>活检小组织，鳞状细胞癌。\n肿瘤细胞免疫表型：Ckpan（AEI/AE3）（+）、P40（+）、NUT（-）、TTF-1（-）、Napsin A（-）、P16（-）",
            "diagnosis": ""
        },
        {
            "check_type": "病理检查",
            "item": "左肺上叶",
            "result": "病理信息：\n肿瘤组织取材部位：左肺上叶，\n标本类型：活检标本\n检测试剂：Dako 22C3\n检测平台：Dako Autostainer Link48\n\n质量控制：\n肿瘤细胞数量是否充足：是\n对照切片结果：\n阳性对照：成功\n阴性对照：成功\n\n检测结果：（TPS）（Dako 22C3）\n肿瘤比例评分范围：TPS >= 50%\n肿瘤比例评分：TPS 70%",
            "diagnosis": ""
        },
        {
            "check_type": "基因检测（PCR/一代测序）",
            "item": "EGFR+ALK+ROS1+KRAS等10基因",
            "result": "未检测到EGFR基因Exon-18、Exon-19、Exon-20、Exon-21外显子基因突变，\n未检测到EGFR基因T790M基因突变，\n未检测到ALK-EML4/KIF5B融合基因突变，\n未检测到ROS1融合基因突变，\n未检测到RET融合基因突变，\n未检测到k-ras基因Exon-2外显子突变，\n未检测到N-ras基因Exon-3外显子突变，\n未检测到B-raf V600E基因突变，\n未检测到PIK3CA基因Exon-9，Exon-20号外显子突变，\n未检测到HER2基因Exon-20号外显子插入突变，\n未检测到MET基因Exon-14号外显子跳跃突变。\n检测方法：PCR（ARMS）法",
            "diagnosis": ""
        }
    ]
}

if __name__ == '__main__':
    mdt = MDT(model_name="gpt-4o", examination_data=examination_data)
    result = asyncio.run(mdt.respond(
        diagnosis_data={
            "诊断结果": "左肺鳞状细胞癌，伴左肺门及纵隔淋巴结转移，左肺上叶阻塞性炎变、实变不张，心包微少量积液，左侧胸腔少量积液，左侧胸膜稍增厚。肝内小囊肿可能；肝内钙化灶；双肾小囊肿；颅内未见确切占位；扫及空泡蝶鞍可能，随诊。全身骨显像未见明显骨质代谢异常征像。",
        },
        dialogue_history={
            "Doctor": "根据您的检查结果，您被诊断为左肺鳞状细胞癌，并且已经出现了淋巴结转移。这是一种需要积极治疗的疾病。",
            "Patient": "听到这个消息我很害怕，我该怎么办？"
        },
        analysis="患者表现出明显的焦虑情绪，对诊断结果感到恐慌和不安。",
        strategy="向患者解释CT结果、脚掌X射线检查、尿液血红蛋白结果，安抚患者情绪。"
    ))
    print(result)
